# 지난주 과제 설명

In [32]:
import zipfile
import os
import pandas as pd
import shutil

In [7]:
os.getcwd()

'/home/swp/workspace'

In [8]:
with zipfile.ZipFile("../이름_생년_성별_10000.zip", "r") as f:
    f.extractall("./data/")

In [16]:
gender = os.listdir("./data")[0].split("_")[-1][0]

In [17]:
gender

'1'

In [33]:
male_list = []
female_list = []

if not os.path.isdir("./남성"):
    os.mkdir("./남성")
if not os.path.isdir("./여성"):
    os.mkdir("./여성")

for file in os.listdir("./data"):
    gender = file.split("_")[-1][0]
    if gender == '1' or gender == '3':
    # 위코드와 같은 코드
    # if gender in ['1','3']:
    #     print(gender)
        # print("남성", end=" ")
        with open(f"./data/{file}", 'r', encoding='utf-8') as f:
            male_list.append(['남성', f.read().replace(',', '')])
        shutil.move(f"./data/{file}", f"./남성/{file}")
    else: 
        with open(f"./data/{file}", 'r', encoding='utf-8') as f:
            female_list.append(['여성', f.read().replace(',', '')])
        shutil.move(f"./data/{file}", f"./여성/{file}")

        # print("여성", end=" ")

In [34]:
male_df = pd.DataFrame(male_list, columns=['성별', '금액'])
female_df = pd.DataFrame(female_list, columns=['성별', '금액'])

In [36]:
df = pd.concat([male_df, female_df])

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10000 entries, 0 to 5006
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   성별      10000 non-null  object
 1   금액      10000 non-null  object
dtypes: object(2)
memory usage: 234.4+ KB

In [39]:
df['금액'] = df['금액'].astype(int)
# for문 돌리면 너무 오래걸리고 int() 사용불가 -> 시리즈타입이기 때문에

In [44]:
df.groupby(['성별'])[['금액']].mean()
# 공학적 숫자 표기법

              금액
성별
남성  1.190018e+07
여성  1.280237e+07

In [43]:
df.groupby(['성별'])['금액'].mean().values

array([11900177.71239736, 12802368.48332335])

In [45]:
df.groupby(['성별'])[['금액']].mean().reset_index()

   성별            금액
0  남성  1.190018e+07
1  여성  1.280237e+07

In [46]:
df.groupby(['성별'], as_index=False)[['금액']].mean()

   성별            금액
0  남성  1.190018e+07
1  여성  1.280237e+07

In [49]:
# agg -> aggregate
# avg -> mean
df.groupby(['성별'], as_index=False)[['금액']].agg(['mean', 'median', 'var', 'std', 'count'])

   성별            금액
               mean   median           var           std count
0  남성  1.190018e+07  90329.0  6.400252e+14  2.529872e+07  4993
1  여성  1.280237e+07  96714.0  6.834308e+14  2.614251e+07  5007

In [50]:
import pickle
with open("./kbo_detail.pkl", 'rb') as f:
    kbo = pickle.load(f)

In [54]:
data = {'df': df,
'kbo': kbo}

In [57]:
with open('./tmp.pkl', 'wb') as f:
    pickle.dump(data, f)

In [55]:
data['kbo']

,선수명,등번호,생년월일,포지션,신장/체중,경력,입단 계약금,연봉,지명순위,입단년도,team
0,강재민,No.,1997년 04월 03일,투수(우언우타),180cm/89kg,양덕초-마산중-용마고-단국대,8000만원,14500만원,20 한화 2차 4라운드 38순위,20한화,한화 이글스
1,권광민,No.17,1997년 12월 12일,외야수(좌투좌타),189cm/102kg,서울청구초-홍은중-장충고,,3300만원,22 한화 2차 5라운드 41순위,16시카고컵스,한화 이글스
2,권동욱,No.02,2001년 01월 08일,외야수(우투우타),173cm/85kg,가동초-휘문중-배명고-동국대,,3000만원,24 한화 육성선수,,한화 이글스
3,권현,No.111,2005년 02월 23일,외야수(우투우타),182cm/88kg,사당초-언북중-장충고,3000만원,3000만원,24 한화 10라운드 91순위,,한화 이글스
4,김강민,No.9,1982년 09월 13일,외야수(우투우타),182cm/87kg,본리초-대구중-경북고-SK-SSG,11000만원,11000만원,01 SK 2차 2라운드 18순위,01SK,한화 이글스
...,...,...,...,...,...,...,...,...,...,...,...
839,한민우,No.96,1999년 04월 27일,투수(좌투좌타),177cm/82kg,동일중앙초-경남중-경남고,1000만원,3000만원,23 KT 육성선수,,KT 위즈
840,한차현,No.59,1998년 11월 30일,투수(우투우타),180cm/80kg,사능초(남양주리틀)-청원중-포항제철고-성균관대,10000만원,3100만원,21 KT 2차 2라운드 15순위,21KT,KT 위즈
841,홍현빈,No.31,1997년 08월 29일,외야수(우투좌타),174cm/70kg,수원신곡초-매송중-유신고-KT-상무,9000만원,4500만원,17 KT 2차 3라운드 21순위,17KT,KT 위즈
842,황의준,No.103,2002년 04월 06일,외야수(우투좌타),185cm/95kg,칠성초-경복중-경북고-수성대,4000만원,3000만원,23 KT 8라운드 80순위,,KT 위즈
843,황재균,No.10,1987년 07월 28일,내야수(우투우타),183cm/96kg,사당초-서울이수중-경기고-현대-히어로즈-롯데-샌프란시스코,6000만원,100000만원,06 현대 2차 3라운드 24순위,06현대,KT 위즈

In [60]:
kbo['초등'] = kbo['경력'].apply(lambda x : x.split('-')[0])

In [65]:
kbo.groupby(['초등'])['선수명'].count().sort_values()[::-1].head(10)

초등
부산수영초    19
본리초      14
가동초      14
양정초      14
광주대성초    13
성동초      13
광주수창초    13
도신초      12
송정동초     12
광주서석초    11
Name: 선수명, dtype: int64

In [67]:
kbo.groupby(['초등'])['선수명'].count().sort_values(ascending=False)

초등
부산수영초            19
본리초              14
양정초              14
가동초              14
광주대성초            13
                 ..
방배초               1
발산초               1
반안초(해운대리틀)        1
미국 Yucaipa(고)     1
법동초               1
Name: 선수명, Length: 343, dtype: int64

In [69]:
kbo.value_counts(['초등'], normalize=True)

초등
부산수영초            0.022512
본리초              0.016588
양정초              0.016588
가동초              0.016588
광주대성초            0.015403
                   ...
방배초              0.001185
발산초              0.001185
반안초(해운대리틀)       0.001185
미국 Yucaipa(고)    0.001185
법동초              0.001185
Name: proportion, Length: 343, dtype: float64

In [72]:
from datetime import date, datetime

In [75]:
datetime.strptime("1997년 04월 03일", '%Y년 %m월 %d일')

datetime.datetime(1997, 4, 3, 0, 0)

In [77]:
kbo['생년월일'] = kbo['생년월일'].apply(lambda x : datetime.strptime(x.strip(), '%Y년 %m월 %d일'))

In [79]:
kbo['생년월일']

0     1997-04-03
1     1997-12-12
2     2001-01-08
3     2005-02-23
4     1982-09-13
         ...
839   1999-04-27
840   1998-11-30
841   1997-08-29
842   2002-04-06
843   1987-07-28
Name: 생년월일, Length: 844, dtype: datetime64[ns]

In [83]:
kbo['생존일'] = kbo['생년월일'].apply(lambda x : (datetime.now() - x).days)

In [90]:
kbo.sort_values(by=['생존일', '선수명'], ascending=[False, True]).head(3)

,선수명,등번호,생년월일,포지션,신장/체중,경력,입단 계약금,연봉,지명순위,입단년도,team,초등,생존일
251,추신수,No.17,1982-07-13,외야수(좌투좌타),180cm/97kg,부산수영초-부산중-부산고-SK,,3000만원,07 해외진출선수 특별지명,00시애틀,SSG 랜더스,부산수영초,15245
718,오승환,No.21,1982-07-15,투수(우투우타),178cm/93kg,도신초-우신중-경기고-단국대-삼성-한신-세인트루이스-토론토-콜로라도,18000만원,40000만원,05 삼성 2차 1라운드 5순위,05삼성,삼성 라이온즈,도신초,15243
4,김강민,No.9,1982-09-13,외야수(우투우타),182cm/87kg,본리초-대구중-경북고-SK-SSG,11000만원,11000만원,01 SK 2차 2라운드 18순위,01SK,한화 이글스,본리초,15183

In [93]:
kbo['나이'] = kbo['생년월일'].apply(lambda x : datetime.now().year - x.year)

In [94]:
kbo

,선수명,등번호,생년월일,포지션,신장/체중,경력,입단 계약금,연봉,지명순위,입단년도,team,초등,생존일,나이
0,강재민,No.,1997-04-03,투수(우언우타),180cm/89kg,양덕초-마산중-용마고-단국대,8000만원,14500만원,20 한화 2차 4라운드 38순위,20한화,한화 이글스,양덕초,9867,27
1,권광민,No.17,1997-12-12,외야수(좌투좌타),189cm/102kg,서울청구초-홍은중-장충고,,3300만원,22 한화 2차 5라운드 41순위,16시카고컵스,한화 이글스,서울청구초,9614,27
2,권동욱,No.02,2001-01-08,외야수(우투우타),173cm/85kg,가동초-휘문중-배명고-동국대,,3000만원,24 한화 육성선수,,한화 이글스,가동초,8491,23
3,권현,No.111,2005-02-23,외야수(우투우타),182cm/88kg,사당초-언북중-장충고,3000만원,3000만원,24 한화 10라운드 91순위,,한화 이글스,사당초,6984,19
4,김강민,No.9,1982-09-13,외야수(우투우타),182cm/87kg,본리초-대구중-경북고-SK-SSG,11000만원,11000만원,01 SK 2차 2라운드 18순위,01SK,한화 이글스,본리초,15183,42
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
839,한민우,No.96,1999-04-27,투수(좌투좌타),177cm/82kg,동일중앙초-경남중-경남고,1000만원,3000만원,23 KT 육성선수,,KT 위즈,동일중앙초,9113,25
840,한차현,No.59,1998-11-30,투수(우투우타),180cm/80kg,사능초(남양주리틀)-청원중-포항제철고-성균관대,10000만원,3100만원,21 KT 2차 2라운드 15순위,21KT,KT 위즈,사능초(남양주리틀),9261,26
841,홍현빈,No.31,1997-08-29,외야수(우투좌타),174cm/70kg,수원신곡초-매송중-유신고-KT-상무,9000만원,4500만원,17 KT 2차 3라운드 21순위,17KT,KT 위즈,수원신곡초,9719,27
842,황의준,No.103,2002-04-06,외야수(우투좌타),185cm/95kg,칠성초-경복중-경북고-수성대,4000만원,3000만원,23 KT 8라운드 80순위,,KT 위즈,칠성초,8038,22
843,황재균,No.10,1987-07-28,내야수(우투우타),183cm/96kg,사당초-서울이수중-경기고-현대-히어로즈-롯데-샌프란시스코,6000만원,100000만원,06 현대 2차 3라운드 24순위,06현대,KT 위즈,사당초,13404,37

In [107]:
kbo.team.unique()

array(['한화 이글스', 'KIA 타이거즈', 'SSG 랜더스', 'NC 다이노스', 'LG 트윈스', '키움 히어로즈',
       '두산 베어스', '롯데 자이언츠', '삼성 라이온즈', 'KT 위즈'], dtype=object)

In [106]:
kbo.loc[kbo.team == '고양 히어로즈', 'team'] = '키움 히어로즈'

In [109]:
kbo.groupby(['team'])['나이'].agg(['mean', 'var', 'median'])

               mean        var  median
team
KIA 타이거즈  25.988095  25.698652    25.0
KT 위즈     26.701149  29.467789    26.0
LG 트윈스    26.013514  23.027212    25.0
NC 다이노스   25.112360  20.214505    24.0
SSG 랜더스   26.259259  34.419444    25.0
두산 베어스    25.678571  23.064114    25.0
롯데 자이언츠   26.152941  30.131092    25.0
삼성 라이온즈   26.329412  32.961625    25.0
키움 히어로즈   24.719512  25.191960    24.0
한화 이글스    25.892473  26.118747    24.0

In [112]:
kbo[kbo.team == '삼성 라이온즈'].value_counts('나이').head(5)

나이
23    10
25     9
21     8
20     7
28     6
Name: count, dtype: int64

In [118]:
kbo[kbo.team == '키움 히어로즈'].value_counts('나이', normalize=True).head(5).cumsum()
# cumsum() = 누적 합계

나이
20    0.195122
19    0.292683
24    0.390244
23    0.475610
25    0.548780
Name: proportion, dtype: float64

In [120]:
# 기술통계값
kbo.describe()

                                생년월일           생존일          나이
count                            844    844.000000  844.000000
mean   1998-07-30 14:19:54.312796160   9383.402844   25.883886
min              1982-07-13 00:00:00   6691.000000   19.000000
25%              1995-05-04 00:00:00   7955.000000   22.000000
50%              1999-09-12 12:00:00   8974.500000   25.000000
75%              2002-06-28 00:00:00  10567.000000   29.000000
max              2005-12-13 00:00:00  15245.000000   42.000000
std                              NaN   1899.180359    5.200673

# GS25 편의점